// Напишите функцию, которая вычисляет и возвращает стоимость корзины товаров после применения всех скидок. В качестве аргументов функция принимает 3 параметра:
// •	Общая сумма корзины
// •	Количество товаров в корзине
// •	Промокод (по умолчанию null)

// Правила и порядок (порядок важен!) начисления скидок:
// 1.	Если промокод равен 'ДАРИМ300', то из суммы вычитается 300 рублей. При этом если сумма меньше 300 рублей, то итоговая стоимость будет 0.
// 2.	При количестве товаров в корзине ≥10 применяется скидка 5% ко всей сумме
// 3.	При сумме, превышающей 50 000, применяется скидка 20% к сумме превышения (то есть к разнице суммы корзины и 50 000)
// 4.	Если промокод равен 'СКИДКА15', то ко всей сумме применяется скидка 15%, но только если сумма ≥20 000

// Каждая следующая скидка должна проверяться и применяться к сумме после применения предыдущих скидок.

function calculateResultPrice(totalPrice, countGoods, promoCode = null) {
  let result = totalPrice;
  if (promoCode == 'ДАРИМ300') {
    result = Math.max(0, result - 300);
  }
  if (countGoods >= 10) {
    result *= 0.95;
  }
  if (result >= 50000) {
    result -= (result - 50000) * 0.2;
  }
  if (promoCode == 'СКИДКА15' && result >= 20000) {
    result *= 0.85;
  }
  return result;
}
console.log(calculateResultPrice(100000, 10, 'ДАРИМ300')); // вернет 85772
console.log(calculateResultPrice(100000, 10, 'СКИДКА15')); // вернет 73100